// создать класс в котором будут создаваться пользователи, товары и обрабатываться заказы
// создать класс заказ - статус, товары, общая сумма
//
// Вариант как будет работать:
// 1 Создается список товаров (список товаров хранится в главном классе)
// 2 Создается пользователь (список пользователей хранится в главном классе)
// 3 Создается заказ для пользователя (список всех заказов хранится в главном классе)
// 4 В заказ добавляются товары
// 5 Заказ добавляется в список заказов пользователя
// 6 Меняется статус заказа
//
// Дополнительное
// При изменении выполненного заказа выводить ошибку
// Навигация по консольному приложению (меню)
//
// Требования
// Соблюдать dependency injection: в классе-сущности
// (например пользователь, заказ, но не главный класс (т.к это служебный класс))
// не создавать объекты других сущностей (в классе заказ не создавать объект пользователя)


public class Test {
    public static void main (String [] args) {

    }
}